#+TITLE: My Special Emacs Configuration
#+AUTHOR: logan mohseni
#+EMAIL: mohsenil85@gmail.com 


** flycheck
   #+begin_src emacs-lisp
  (use-package flycheck
    :ensure
    :diminish ""
    :config
    (progn
      (add-hook 'after-init-hook #'global-flycheck-mode)))
      

(flycheck-define-checker proselint
  "A linter for prose."
  :command ("proselint" source-inplace)
  :error-patterns
  ((warning line-start (file-name) ":" line ":" column ": "
        (id (one-or-more (not (any " "))))
        (message) line-end))
  :modes (text-mode markdown-mode gfm-mode))

(add-to-list 'flycheck-checkers 'proselint)

   #+end_src

   #+RESULTS:
   | proselint | ada-gnat | asciidoc | c/c++-clang | c/c++-gcc | c/c++-cppcheck | cfengine | chef-foodcritic | coffee | coffee-coffeelint | coq | css-csslint | d-dmd | elixir-dogma | emacs-lisp | emacs-lisp-checkdoc | erlang | eruby-erubis | fortran-gfortran | go-gofmt | go-golint | go-vet | go-build | go-test | go-errcheck | go-unconvert | groovy | haml | handlebars | haskell-stack-ghc | haskell-ghc | haskell-hlint | html-tidy | javascript-eslint | javascript-jshint | javascript-gjslint | javascript-jscs | javascript-standard | json-jsonlint | json-python-json | less | lua-luacheck | lua | perl | perl-perlcritic | php | php-phpmd | php-phpcs | processing | pug | puppet-parser | puppet-lint | python-flake8 | python-pylint | python-pycompile | r-lintr | racket | rpm-rpmlint | markdown-mdl | rst-sphinx | rst | ruby-rubocop | ruby-rubylint | ruby | ruby-jruby | rust-cargo | rust | scala | scala-scalastyle | scheme-chicken | scss-lint | sass/scss-sass-lint | sass | scss | sh-bash | sh-posix-dash | sh-posix-bash | sh-zsh | sh-shellcheck | slim | slim-lint | sql-sqlint | tex-chktex | tex-lacheck | texinfo | typescript-tslint | verilog-verilator | xml-xmlstarlet | xml-xmllint | yaml-jsyaml | yaml-ruby |

** inital buffer
   #+BEGIN_SRC emacs-lisp
  ;(setq initial-buffer-choice "~/org")
  ;(setq initial-buffer-choice "~/org/organizer.org")
  
(setq initial-buffer-choice  (bookmark-bmenu-list))

;  (org-agenda-list)
;  (delete-other-windows)
;  (org-agenda-day-view)
   #+END_SRC

   #+RESULTS:
   :  %% Bookmark                      File

** registers
   #+BEGIN_SRC emacs-lisp
(set-register ?e (cons 'file "~/.emacs.d/emacs-init.org"))
(set-register ?o (cons 'file "~/org/organizer.org"))
(set-register ?w (cons 'file "~/org/work.org"))
(set-register ?z (cons 'file "~/.zshrc"))
(set-register ?d (cons 'file "~/Projects/lisp/drogue/drogue.lisp"))
   #+END_SRC

   #+RESULTS:
   : (file . ~/Projects/lisp/drogue/drogue.lisp)

** hippie-expand 
   as per http://blog.binchen.org/posts/autocomplete-with-a-dictionary-with-hippie-expand.html
   and 
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "M-/") 'hippie-expand)

     ;; The actual expansion function
     (defun try-expand-by-dict (old)
       ;; old is true if we have already attempted an expansion
       (unless (bound-and-true-p ispell-minor-mode)
         (ispell-minor-mode 1))

       ;; english-words.txt is the fallback dicitonary
       (if (not ispell-alternate-dictionary)
           (setq ispell-alternate-dictionary (file-truename "~/.emacs.d/misc/english-words.txt")))
       (let ((lookup-func (if (fboundp 'ispell-lookup-words)
                            'ispell-lookup-words
                            'lookup-words)))
         (unless old
           (he-init-string (he-lisp-symbol-beg) (point))
           (if (not (he-string-member he-search-string he-tried-table))
             (setq he-tried-table (cons he-search-string he-tried-table)))
           (setq he-expand-list
                 (and (not (equal he-search-string ""))
                      (funcall lookup-func (concat (buffer-substring-no-properties (he-lisp-symbol-beg) (point)) "*")))))
         (if (null he-expand-list)
           (if old (he-reset-string))
           (he-substitute-string (car he-expand-list))
           (setq he-expand-list (cdr he-expand-list))
           t)
         ))

(defun try-expand-flexible-abbrev (old)
  "Try to complete word using flexible matching.

Flexible matching works by taking the search string and then
interspersing it with a regexp for any character. So, if you try
to do a flexible match for `foo' it will match the word
`findOtherOtter' but also `fixTheBoringOrange' and
`ifthisisboringstopreadingnow'.

The argument OLD has to be nil the first call of this function, and t
for subsequent calls (for further possible completions of the same
string).  It returns t if a new completion is found, nil otherwise."
  (if (not old)
      (progn
        (he-init-string (he-lisp-symbol-beg) (point))
        (if (not (he-string-member he-search-string he-tried-table))
            (setq he-tried-table (cons he-search-string he-tried-table)))
        (setq he-expand-list
              (and (not (equal he-search-string ""))
                   (he-flexible-abbrev-collect he-search-string)))))
  (while (and he-expand-list
              (he-string-member (car he-expand-list) he-tried-table))
    (setq he-expand-list (cdr he-expand-list)))
  (if (null he-expand-list)
      (progn
        (if old (he-reset-string))
        ())
      (progn
        (he-substitute-string (car he-expand-list))
        (setq he-expand-list (cdr he-expand-list))
        t)))

(defun he-flexible-abbrev-collect (str)
  "Find and collect all words that flex-matches STR.
See docstring for `try-expand-flexible-abbrev' for information
about what flexible matching means in this context."
  (let ((collection nil)
        (regexp (he-flexible-abbrev-create-regexp str)))
    (save-excursion
      (goto-char (point-min))
      (while (search-forward-regexp regexp nil t)
        ;; Is there a better or quicker way than using
        ;; `thing-at-point' here?
        (setq collection (cons (thing-at-point 'word) collection))))
    collection))

(defun he-flexible-abbrev-create-regexp (str)
  "Generate regexp for flexible matching of STR.
See docstring for `try-expand-flexible-abbrev' for information
about what flexible matching means in this context."
  (concat "\\b" (mapconcat (lambda (x) (concat "\\w*" (list x))) str "")
          "\\w*" "\\b"))

     (setq hippie-expand-try-functions-list
           '(try-complete-file-name-partially
             try-complete-file-name
             try-expand-all-abbrevs
             try-expand-list
             try-expand-line
             try-expand-dabbrev
             try-expand-dabbrev-all-buffers
             try-expand-dabbrev-from-kill
             try-complete-lisp-symbol-partially
             try-complete-lisp-symbol
             try-expand-by-dict
             ;;try-expand-flexible-abbrev
             yas-hippie-try-expand
))
   #+END_SRC

   #+RESULTS:
   | try-complete-file-name-partially | try-complete-file-name | try-expand-all-abbrevs | try-expand-list | try-expand-line | try-expand-dabbrev | try-expand-dabbrev-all-buffers | try-expand-dabbrev-from-kill | try-complete-lisp-symbol-partially | try-complete-lisp-symbol | try-expand-by-dict | try-expand-flexible-abbrev | yas-hippie-try-expand |

** text-mode stuff
   #+BEGIN_SRC emacs-lisp

     ;(add-hook 'text-mode-hook 'flyspell-mode)
;    ;(add-hook 'text-mode-hook 'writeroom-mode)
     ;(add-hook 'text-mode-hook #'(lambda()(linum-mode 0)))
   #+END_SRC

   #+RESULTS:
   | (lambda nil (linum-mode 0)) | writeroom-mode | flyspell-mode | text-mode-hook-identify |


** recentf
   #+BEGIN_SRC emacs-lisp
 (recentf-mode 1)
     (run-at-time nil (* 5 60) 'recentf-save-list)
   #+END_SRC

   #+RESULTS:
   : [nil 22483 8721 398038 300 recentf-save-list nil nil 0]

*** more sanity
    #+BEGIN_SRC emacs-lisp
 (setq delete-old-versions -1 )		; delete excess backup versions silently
 (setq version-control t )		; use version control
 (setq vc-make-backup-files t )		; make backups file even when in version controlled dir
 (setq backup-directory-alist `(("." . "~/.emacs.d/backups")) ) ; which directory to put backups file
 (setq vc-follow-symlinks t )				       ; don't ask for confirmation when opening symlinked file
 (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)) ) ;transform backups file name
 (setq inhibit-startup-screen t )	; inhibit useless and old-school startup screen
 (setq ring-bell-function 'ignore )	; silent bell when you make a mistake
 (setq coding-system-for-read 'utf-8 )	; use utf-8 by default
 (setq coding-system-for-write 'utf-8 )
 (setq sentence-end-double-space nil)	; sentence SHOULD end with only a point.
 (setq default-fill-column 80)		; toggle wrapping text at the 80th character
 (setq initial-scratch-message ";;;;happy hacking") ; print a default message in the empty scratch buffer opened at startup

    #+END_SRC

    #+RESULTS:
    : ;;;;happy hacking
** persist kill ring
   #+BEGIN_SRC emacs-lisp
     (savehist-mode 1)
     (setq savehist-additional-variables 
     '(kill-ring search-ring regexp-search-ring))
     (setq savehist-file "~/.emacs.d/tmp/savehist")
   #+END_SRC

   #+RESULTS:
   : ~/.emacs.d/tmp/savehist

* diminish
  #+BEGIN_SRC emacs-lisp
(diminish 'wrap-region-mode)
(diminish 'yas-minor-mode)
(diminish 'auto-revert-mode )
(diminish 'undo-tree-mode )
(diminish 'git-gutter-mode )
(diminish 'visual-line-mode )
(diminish 'flyspell-mode )


  #+END_SRC

  #+RESULTS:
  |   |

  
